GopalSaraf/Practicals/PSDL/include/proc/pic12f1822.inc
// Register: FSR1H
#define FSR1H FSR1H
FSR1H                                    equ 0007h
// bitfield definitions
FSR1H_FSR1H_POSN                         equ 0000h
FSR1H_FSR1H_POSITION                     equ 0000h
FSR1H_FSR1H_SIZE                         equ 0008h
FSR1H_FSR1H_LENGTH                       equ 0008h
FSR1H_FSR1H_MASK                         equ 00FFh

// Register: BSR
#define BSR BSR
BSR                                      equ 0008h
// bitfield definitions
BSR_BSR0_POSN                            equ 0000h
BSR_BSR0_POSITION                        equ 0000h
BSR_BSR0_SIZE                            equ 0001h
BSR_BSR0_LENGTH                          equ 0001h
BSR_BSR0_MASK                            equ 0001h
BSR_BSR1_POSN                            equ 0001h
BSR_BSR1_POSITION                        equ 0001h
BSR_BSR1_SIZE                            equ 0001h
BSR_BSR1_LENGTH                          equ 0001h
BSR_BSR1_MASK                            equ 0002h
BSR_BSR2_POSN                            equ 0002h
BSR_BSR2_POSITION                        equ 0002h
BSR_BSR2_SIZE                            equ 0001h
BSR_BSR2_LENGTH                          equ 0001h
BSR_BSR2_MASK                            equ 0004h
BSR_BSR3_POSN                            equ 0003h
BSR_BSR3_POSITION                        equ 0003h
BSR_BSR3_SIZE                            equ 0001h
BSR_BSR3_LENGTH                          equ 0001h
BSR_BSR3_MASK                            equ 0008h
BSR_BSR4_POSN                            equ 0004h
BSR_BSR4_POSITION                        equ 0004h
BSR_BSR4_SIZE                            equ 0001h
BSR_BSR4_LENGTH                          equ 0001h
BSR_BSR4_MASK                            equ 0010h
BSR_BSR_POSN                             equ 0000h
BSR_BSR_POSITION                         equ 0000h
BSR_BSR_SIZE                             equ 0005h
BSR_BSR_LENGTH                           equ 0005h
BSR_BSR_MASK                             equ 001Fh

// Register: WREG
#define WREG WREG
WREG                                     equ 0009h
// bitfield definitions
WREG_WREG0_POSN                          equ 0000h
WREG_WREG0_POSITION                      equ 0000h
WREG_WREG0_SIZE                          equ 0008h
WREG_WREG0_LENGTH                        equ 0008h
WREG_WREG0_MASK                          equ 00FFh

// Register: PCLATH
#define PCLATH PCLATH
PCLATH                                   equ 000Ah
// bitfield definitions
PCLATH_PCLATH_POSN                       equ 0000h
PCLATH_PCLATH_POSITION                   equ 0000h
PCLATH_PCLATH_SIZE                       equ 0007h
PCLATH_PCLATH_LENGTH                     equ 0007h
PCLATH_PCLATH_MASK                       equ 007Fh

// Register: INTCON
#define INTCON INTCON
INTCON                                   equ 000Bh
// bitfield definitions
INTCON_IOCIF_POSN                        equ 0000h
INTCON_IOCIF_POSITION                    equ 0000h
INTCON_IOCIF_SIZE                        equ 0001h
INTCON_IOCIF_LENGTH                      equ 0001h
INTCON_IOCIF_MASK                        equ 0001h
INTCON_INTF_POSN                         equ 0001h
INTCON_INTF_POSITION                     equ 0001h
INTCON_INTF_SIZE                         equ 0001h
INTCON_INTF_LENGTH                       equ 0001h
INTCON_INTF_MASK                         equ 0002h
INTCON_TMR0IF_POSN                       equ 0002h
INTCON_TMR0IF_POSITION                   equ 0002h
INTCON_TMR0IF_SIZE                       equ 0001h
INTCON_TMR0IF_LENGTH                     equ 0001h
INTCON_TMR0IF_MASK                       equ 0004h
INTCON_IOCIE_POSN                        equ 0003h
INTCON_IOCIE_POSITION                    equ 0003h
INTCON_IOCIE_SIZE                        equ 0001h
INTCON_IOCIE_LENGTH                      equ 0001h
INTCON_IOCIE_MASK                        equ 0008h
INTCON_INTE_POSN                         equ 0004h
INTCON_INTE_POSITION                     equ 0004h
INTCON_INTE_SIZE                         equ 0001h
INTCON_INTE_LENGTH                       equ 0001h
INTCON_INTE_MASK                         equ 0010h
INTCON_TMR0IE_POSN                       equ 0005h
INTCON_TMR0IE_POSITION                   equ 0005h
INTCON_TMR0IE_SIZE                       equ 0001h
INTCON_TMR0IE_LENGTH                     equ 0001h
INTCON_TMR0IE_MASK                       equ 0020h
INTCON_PEIE_POSN                         equ 0006h
INTCON_PEIE_POSITION                     equ 0006h
INTCON_PEIE_SIZE                         equ 0001h
INTCON_PEIE_LENGTH                       equ 0001h
INTCON_PEIE_MASK                         equ 0040h
INTCON_GIE_POSN                          equ 0007h
INTCON_GIE_POSITION                      equ 0007h
INTCON_GIE_SIZE                          equ 0001h
INTCON_GIE_LENGTH                        equ 0001h
INTCON_GIE_MASK                          equ 0080h
INTCON_T0IF_POSN                         equ 0002h
INTCON_T0IF_POSITION                     equ 0002h
INTCON_T0IF_SIZE                         equ 0001h
INTCON_T0IF_LENGTH                       equ 0001h
INTCON_T0IF_MASK                         equ 0004h
INTCON_T0IE_POSN                         equ 0005h
INTCON_T0IE_POSITION                     equ 0005h
INTCON_T0IE_SIZE                         equ 0001h
INTCON_T0IE_LENGTH                       equ 0001h
INTCON_T0IE_MASK                         equ 0020h

// Register: PORTA
#define PORTA PORTA
PORTA                                    equ 000Ch
// bitfield definitions
PORTA_RA0_POSN                           equ 0000h
PORTA_RA0_POSITION                       equ 0000h
PORTA_RA0_SIZE                           equ 0001h
PORTA_RA0_LENGTH                         equ 0001h
PORTA_RA0_MASK                           equ 0001h
PORTA_RA1_POSN                           equ 0001h
PORTA_RA1_POSITION                       equ 0001h
PORTA_RA1_SIZE                           equ 0001h
PORTA_RA1_LENGTH                         equ 0001h
PORTA_RA1_MASK                           equ 0002h
PORTA_RA2_POSN                           equ 0002h
PORTA_RA2_POSITION                       equ 0002h
PORTA_RA2_SIZE                           equ 0001h
PORTA_RA2_LENGTH                         equ 0001h
PORTA_RA2_MASK                           equ 0004h
PORTA_RA3_POSN                           equ 0003h
PORTA_RA3_POSITION                       equ 0003h
PORTA_RA3_SIZE                           equ 0001h
PORTA_RA3_LENGTH                         equ 0001h
PORTA_RA3_MASK                           equ 0008h
PORTA_RA4_POSN                           equ 0004h
PORTA_RA4_POSITION                       equ 0004h
PORTA_RA4_SIZE                           equ 0001h
PORTA_RA4_LENGTH                         equ 0001h
PORTA_RA4_MASK                           equ 0010h
PORTA_RA5_POSN                           equ 0005h
PORTA_RA5_POSITION                       equ 0005h
PORTA_RA5_SIZE                           equ 0001h
PORTA_RA5_LENGTH                         equ 0001h
PORTA_RA5_MASK                           equ 0020h
PORTA_AN0_POSN                           equ 0000h
PORTA_AN0_POSITION                       equ 0000h
PORTA_AN0_SIZE                           equ 0001h
PORTA_AN0_LENGTH                         equ 0001h
PORTA_AN0_MASK                           equ 0001h
PORTA_AN1_POSN                           equ 0001h
PORTA_AN1_POSITION                       equ 0001h
PORTA_AN1_SIZE                           equ 0001h
PORTA_AN1_LENGTH                         equ 0001h
PORTA_AN1_MASK                           equ 0002h
PORTA_AN2_POSN                           equ 0002h
PORTA_AN2_POSITION                       equ 0002h
PORTA_AN2_SIZE                           equ 0001h
PORTA_AN2_LENGTH                         equ 0001h
PORTA_AN2_MASK                           equ 0004h
PORTA_AN3_POSN                           equ 0004h
PORTA_AN3_POSITION                       equ 0004h
PORTA_AN3_SIZE                           equ 0001h
PORTA_AN3_LENGTH                         equ 0001h
PORTA_AN3_MASK                           equ 0010h
PORTA_CPS0_POSN                          equ 0000h
PORTA_CPS0_POSITION                      equ 0000h
PORTA_CPS0_SIZE                          equ 0001h
PORTA_CPS0_LENGTH                        equ 0001h
PORTA_CPS0_MASK                          equ 0001h
PORTA_CPS1_POSN                          equ 0001h
PORTA_CPS1_POSITION                      equ 0001h
PORTA_CPS1_SIZE                          equ 0001h
PORTA_CPS1_LENGTH                        equ 0001h
PORTA_CPS1_MASK                          equ 0002h
PORTA_CPS2_POSN                          equ 0002h
PORTA_CPS2_POSITION                      equ 0002h
PORTA_CPS2_SIZE                          equ 0001h
PORTA_CPS2_LENGTH                        equ 0001h
PORTA_CPS2_MASK                          equ 0004h
PORTA_CPS3_POSN                          equ 0004h
PORTA_CPS3_POSITION                      equ 0004h
PORTA_CPS3_SIZE                          equ 0001h
PORTA_CPS3_LENGTH                        equ 0001h
PORTA_CPS3_MASK                          equ 0010h
PORTA_C1INP_POSN                         equ 0000h
PORTA_C1INP_POSITION                     equ 0000h
PORTA_C1INP_SIZE                         equ 0001h
PORTA_C1INP_LENGTH                       equ 0001h
PORTA_C1INP_MASK                         equ 0001h
PORTA_C1IN0N_POSN                        equ 0001h
PORTA_C1IN0N_POSITION                    equ 0001h
PORTA_C1IN0N_SIZE                        equ 0001h
PORTA_C1IN0N_LENGTH                      equ 0001h
PORTA_C1IN0N_MASK                        equ 0002h
PORTA_C1OUT_POSN                         equ 0002h
PORTA_C1OUT_POSITION                     equ 0002h
PORTA_C1OUT_SIZE                         equ 0001h
PORTA_C1OUT_LENGTH                       equ 0001h
PORTA_C1OUT_MASK                         equ 0004h
PORTA_C1IN1N_POSN                        equ 0004h
PORTA_C1IN1N_POSITION                    equ 0004h
PORTA_C1IN1N_SIZE                        equ 0001h
PORTA_C1IN1N_LENGTH                      equ 0001h
PORTA_C1IN1N_MASK                        equ 0010h
PORTA_DACOUT_POSN                        equ 0000h
PORTA_DACOUT_POSITION                    equ 0000h
PORTA_DACOUT_SIZE                        equ 0001h
PORTA_DACOUT_LENGTH                      equ 0001h
PORTA_DACOUT_MASK                        equ 0001h
PORTA_SRI_POSN                           equ 0001h
PORTA_SRI_POSITION                       equ 0001h
PORTA_SRI_SIZE                           equ 0001h
PORTA_SRI_LENGTH                         equ 0001h
PORTA_SRI_MASK                           equ 0002h
PORTA_SRQ_POSN                           equ 0002h
PORTA_SRQ_POSITION                       equ 0002h
PORTA_SRQ_SIZE                           equ 0001h
PORTA_SRQ_LENGTH                         equ 0001h
PORTA_SRQ_MASK                           equ 0004h
PORTA_SRNQ_POSN                          equ 0005h
PORTA_SRNQ_POSITION                      equ 0005h
PORTA_SRNQ_SIZE                          equ 0001h
PORTA_SRNQ_LENGTH                        equ 0001h
PORTA_SRNQ_MASK                          equ 0020h
PORTA_SCK_POSN                           equ 0001h
PORTA_SCK_POSITION                       equ 0001h
PORTA_SCK_SIZE                           equ 0001h
PORTA_SCK_LENGTH                         equ 0001h
PORTA_SCK_MASK                           equ 0002h
PORTA_T0CKI_POSN                         equ 0002h
PORTA_T0CKI_POSITION                     equ 0002h
PORTA_T0CKI_SIZE                         equ 0001h
PORTA_T0CKI_LENGTH                       equ 0001h
PORTA_T0CKI_MASK                         equ 0004h
PORTA_T1OSO_POSN                         equ 0004h
PORTA_T1OSO_POSITION                     equ 0004h
PORTA_T1OSO_SIZE                         equ 0001h
PORTA_T1OSO_LENGTH                       equ 0001h
PORTA_T1OSO_MASK                         equ 0010h
PORTA_T1CKI_POSN                         equ 0005h
PORTA_T1CKI_POSITION                     equ 0005h
PORTA_T1CKI_SIZE                         equ 0001h
PORTA_T1CKI_LENGTH                       equ 0001h
PORTA_T1CKI_MASK                         equ 0020h
PORTA_SCL_POSN                           equ 0001h
PORTA_SCL_POSITION                       equ 0001h
PORTA_SCL_SIZE                           equ 0001h
PORTA_SCL_LENGTH                         equ 0001h
PORTA_SCL_MASK                           equ 0002h
PORTA_SDA_POSN                           equ 0002h
PORTA_SDA_POSITION                       equ 0002h
PORTA_SDA_SIZE                           equ 0001h
PORTA_SDA_LENGTH                         equ 0001h
PORTA_SDA_MASK                           equ 0004h
PORTA_nMCLR_POSN                         equ 0003h
PORTA_nMCLR_POSITION                     equ 0003h
PORTA_nMCLR_SIZE                         equ 0001h
PORTA_nMCLR_LENGTH                       equ 0001h
PORTA_nMCLR_MASK                         equ 0008h
PORTA_CLKR_POSN                          equ 0004h
PORTA_CLKR_POSITION                      equ 0004h
PORTA_CLKR_SIZE                          equ 0001h
PORTA_CLKR_LENGTH                        equ 0001h
PORTA_CLKR_MASK                          equ 0010h
PORTA_T1OSI_POSN                         equ 0005h
PORTA_T1OSI_POSITION                     equ 0005h
PORTA_T1OSI_SIZE                         equ 0001h
PORTA_T1OSI_LENGTH                       equ 0001h
PORTA_T1OSI_MASK                         equ 0020h
PORTA_MDOUT_POSN                         equ 0000h
PORTA_MDOUT_POSITION                     equ 0000h
PORTA_MDOUT_SIZE                         equ 0001h
PORTA_MDOUT_LENGTH                       equ 0001h
PORTA_MDOUT_MASK                         equ 0001h
PORTA_MDMIN_POSN                         equ 0001h
PORTA_MDMIN_POSITION                     equ 0001h
PORTA_MDMIN_SIZE                         equ 0001h
PORTA_MDMIN_LENGTH                       equ 0001h
PORTA_MDMIN_MASK                         equ 0002h
PORTA_MDCIN1_POSN                        equ 0002h
PORTA_MDCIN1_POSITION                    equ 0002h
PORTA_MDCIN1_SIZE                        equ 0001h
PORTA_MDCIN1_LENGTH                      equ 0001h
PORTA_MDCIN1_MASK                        equ 0004h
PORTA_MDCIN2_POSN                        equ 0004h
PORTA_MDCIN2_POSITION                    equ 0004h
PORTA_MDCIN2_SIZE                        equ 0001h
PORTA_MDCIN2_LENGTH                      equ 0001h
PORTA_MDCIN2_MASK                        equ 0010h
PORTA_SDI_POSN                           equ 0002h
PORTA_SDI_POSITION                       equ 0002h
PORTA_SDI_SIZE                           equ 0001h
PORTA_SDI_LENGTH                         equ 0001h
PORTA_SDI_MASK                           equ 0004h
PORTA_OSC2_POSN                          equ 0004h
PORTA_OSC2_POSITION                      equ 0004h
PORTA_OSC2_SIZE                          equ 0001h
PORTA_OSC2_LENGTH                        equ 0001h
PORTA_OSC2_MASK                          equ 0010h
PORTA_OSC1_POSN                          equ 0005h
PORTA_OSC1_POSITION                      equ 0005h
PORTA_OSC1_SIZE                          equ 0001h
PORTA_OSC1_LENGTH                        equ 0001h
PORTA_OSC1_MASK                          equ 0020h
PORTA_FLT0_POSN                          equ 0002h
PORTA_FLT0_POSITION                      equ 0002h
PORTA_FLT0_SIZE                          equ 0001h
PORTA_FLT0_LENGTH                        equ 0001h
PORTA_FLT0_MASK                          equ 0004h
PORTA_CLKOUT_POSN                        equ 0004h
PORTA_CLKOUT_POSITION                    equ 0004h
PORTA_CLKOUT_SIZE                        equ 0001h
PORTA_CLKOUT_LENGTH                      equ 0001h
PORTA_CLKOUT_MASK                        equ 0010h
PORTA_CLKIN_POSN                         equ 0005h
PORTA_CLKIN_POSITION                     equ 0005h
PORTA_CLKIN_SIZE                         equ 0001h
PORTA_CLKIN_LENGTH                       equ 0001h
PORTA_CLKIN_MASK                         equ 0020h

// Register: PIR1
#define PIR1 PIR1
PIR1                                     equ 0011h
// bitfield definitions
PIR1_TMR1IF_POSN                         equ 0000h
PIR1_TMR1IF_POSITION                     equ 0000h
PIR1_TMR1IF_SIZE                         equ 0001h
PIR1_TMR1IF_LENGTH                       equ 0001h
PIR1_TMR1IF_MASK                         equ 0001h
PIR1_TMR2IF_POSN                         equ 0001h
PIR1_TMR2IF_POSITION                     equ 0001h
PIR1_TMR2IF_SIZE                         equ 0001h
PIR1_TMR2IF_LENGTH                       equ 0001h
PIR1_TMR2IF_MASK                         equ 0002h
PIR1_CCP1IF_POSN                         equ 0002h
PIR1_CCP1IF_POSITION                     equ 0002h
PIR1_CCP1IF_SIZE                         equ 0001h
PIR1_CCP1IF_LENGTH                       equ 0001h
PIR1_CCP1IF_MASK                         equ 0004h
PIR1_SSP1IF_POSN                         equ 0003h
PIR1_SSP1IF_POSITION                     equ 0003h
PIR1_SSP1IF_SIZE                         equ 0001h
PIR1_SSP1IF_LENGTH                       equ 0001h
PIR1_SSP1IF_MASK                         equ 0008h
PIR1_TXIF_POSN                           equ 0004h
PIR1_TXIF_POSITION                       equ 0004h
PIR1_TXIF_SIZE                           equ 0001h
PIR1_TXIF_LENGTH                         equ 0001h
PIR1_TXIF_MASK                           equ 0010h
PIR1_RCIF_POSN                           equ 0005h
PIR1_RCIF_POSITION                       equ 0005h
PIR1_RCIF_SIZE                           equ 0001h
PIR1_RCIF_LENGTH                         equ 0001h
PIR1_RCIF_MASK                           equ 0020h
PIR1_ADIF_POSN                           equ 0006h
PIR1_ADIF_POSITION                       equ 0006h
PIR1_ADIF_SIZE                           equ 0001h
PIR1_ADIF_LENGTH                         equ 0001h
PIR1_ADIF_MASK                           equ 0040h
PIR1_TMR1GIF_POSN                        equ 0007h
PIR1_TMR1GIF_POSITION                    equ 0007h
PIR1_TMR1GIF_SIZE                        equ 0001h
PIR1_TMR1GIF_LENGTH                      equ 0001h
PIR1_TMR1GIF_MASK                        equ 0080h

// Register: PIR2
#define PIR2 PIR2
PIR2                                     equ 0012h
// bitfield definitions
PIR2_BCL1IF_POSN                         equ 0003h
PIR2_BCL1IF_POSITION                     equ 0003h
PIR2_BCL1IF_SIZE                         equ 0001h
PIR2_BCL1IF_LENGTH                       equ 0001h
PIR2_BCL1IF_MASK                         equ 0008h
PIR2_EEIF_POSN                           equ 0004h
PIR2_EEIF_POSITION                       equ 0004h
PIR2_EEIF_SIZE                           equ 0001h
PIR2_EEIF_LENGTH                         equ 0001h
PIR2_EEIF_MASK                           equ 0010h
PIR2_C1IF_POSN                           equ 0005h
PIR2_C1IF_POSITION                       equ 0005h
PIR2_C1IF_SIZE                           equ 0001h
PIR2_C1IF_LENGTH                         equ 0001h
PIR2_C1IF_MASK                           equ 0020h
PIR2_OSFIF_POSN                          equ 0007h
PIR2_OSFIF_POSITION                      equ 0007h
PIR2_OSFIF_SIZE                          equ 0001h
PIR2_OSFIF_LENGTH                        equ 0001h
PIR2_OSFIF_MASK                          equ 0080h

